title: Suspicious Double File Extension in ParentCommandLine
status: experimental
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentCommandLine|contains:
      - ".doc.lnk"
      - ".docx.lnk"
      - ".pdf.lnk"
  condition: selection
